
&НаКлиенте
Процедура ОбновитьКурсыВалют(Команда)
	
	Результат = ОбновитьКурсыВалютНаСервере(); 
	Сообщение = Новый СообщениеПользователю;
	
	Если Результат Тогда		
		Сообщение.Текст = "Курсы валют успешно обновлены";
		Элементы.Список.Обновить();
	Иначе  
		Сообщение.Текст = "Не удалось обновить курсы валют";
	КонецЕсли;
	
	Сообщение.Сообщить();
	
	
КонецПроцедуры

&НаСервере
Функция ОбновитьКурсыВалютНаСервере()
        
	Возврат РаботаСКурсамиВалют.ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();	

КонецФункции
