#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	КонтрольПриПроведенииДокументов.ПроверитьОстаткиДенежныхСредств(Дата, Кошелек, Сумма, Отказ); 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	КонтрольПриПроведенииДокументов.ПроверитьЛимитПоКатегории(Дата, СтатьяРасхода, Сумма, Отказ); 
    
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
	
	Движения.ОплатаОбязательныхПлатежей.Записывать = Истина;
	
	Если ЗначениеЗаполнено(ГрафикПлатежей) Тогда
		
		Движение = Движения.ОплатаОбязательныхПлатежей.Добавить();
		
		Движение.Период 			= Дата;
		Движение.ПредметПлатежа 	= ПредметПлатежа;
		
		Движение.Сумма = Сумма; 
		
	КонецЕсли;  
	
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	
	Движение = Движения.ОстаткиДенежныхСредств.Добавить(); 
	
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Движение.Период 		= Дата;
	Движение.Кошелек 		= Кошелек;
	
	Движение.Сумма = Сумма; 
	
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	
	Движение = Движения.ДвиженияДенежныхСредств.Добавить(); 

	Движение.Период 						= Дата;  
	Движение.СтатьяДвиженияДенежныхСредств 	= СтатьяРасхода;
	
	Движение.Сумма = Сумма;

КонецПроцедуры

#КонецОбласти