#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ГрафикОбязательныхПлатежей.Записывать = Истина;
	
	Движение = Движения.ГрафикОбязательныхПлатежей.Добавить();
	
	Движение.Период = Дата;
		
	Движение.ПредметПлатежа 	= ПредметПлатежа;
	Движение.Сумма 				= Сумма;
	
	Движение.Периодичность 			= Периодичность;
	Движение.ДатаОкончания 			= ДатаОкончания;
	Движение.ДоДостиженияСуммы 		= ДоДостиженияСуммы;
	Движение.ОбщаяСуммаКОплате 		= ОбщаяСуммаКОплате;

КонецПроцедуры

#КонецОбласти