#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры
	
#КонецОбласти  

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГрафикПлатежейПриИзменении(Элемент)  
	
	УстановитьВидимостьДоступностьЭлементов();
	ЗаполнитьДанныеИзГрафика();
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура УстановитьВидимостьДоступностьЭлементов()

	Элементы.ПредметПлатежа.Видимость = ЗначениеЗаполнено(Объект.ГрафикПлатежей);

КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьДанныеИзГрафика()
	
	Если ЗначениеЗаполнено(Объект.ГрафикПлатежей) Тогда
		
		Объект.ПредметПлатежа 			= Объект.ГрафикПлатежей.ПредметПлатежа;
		Объект.Контрагент 				= Объект.ГрафикПлатежей.Контрагент;    
		Объект.Кошелек 					= Объект.ГрафикПлатежей.Счет;
		Объект.СтатьяРасхода 			= Объект.ГрафикПлатежей.СтатьяРасхода;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
	
