Процедура ПроверитьОстаткиДенежныхСредств(Дата, Кошелек, СуммаКСписанию, Отказ) Экспорт    
	
	ИспользуетсяКонтрольДвиженияДенежныхСредств = Константы.КонтролироватьОстаткиДенежныхСредствПриРасходе.Получить();
	
	Если Не ИспользуетсяКонтрольДвиженияДенежныхСредств Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК СуммаОстаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&ДатаОтбора, Кошелек = &Кошелек) КАК ОстаткиДенежныхСредствОстатки
	 |ГДЕ
	 |	ОстаткиДенежныхСредствОстатки.СуммаОстаток >= &СуммаКСписанию";   
	Запрос.УстановитьПараметр("ДатаОтбора", 		Дата);
	Запрос.УстановитьПараметр("Кошелек", 			Кошелек);
	Запрос.УстановитьПараметр("СуммаКСписанию", 	СуммаКСписанию); 
	
	Если Запрос.Выполнить().Пустой() Тогда 
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("На счете %1 не достаточно денежных средств для проведения операции!", Кошелек);
		Сообщение.Сообщить(); 
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПроверитьЛимитПоКатегории(Дата, СтатьяРасхода, Сумма, Отказ) Экспорт
	
	ИспользуетсяКонтрольЛимитов = Константы.КонтролироватьОстаткиЛимитовПриРасходе.Получить();
	
	Если Не ИспользуетсяКонтрольЛимитов Тогда
		Возврат;
	КонецЕсли;                
	
	Лимиты = РегистрыСведений.БюджетыПоКатегориям.СрезПоследних(Дата, Новый Структура("СтатьяРасхода", СтатьяРасхода));
	
	СуммаЛимита = Лимиты[0].СуммаЛимита;
	ПотраченоЗаМесяц = ПолучитьСуммуРасходаЗаМесяц(СтатьяРасхода, Дата) + Сумма;
	
	Если ПотраченоЗаМесяц > СуммаЛимита Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Премышен лимит по статье %1. Потрачено: %2 из %3", СтатьяРасхода, ПотраченоЗаМесяц, СуммаЛимита);
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуРасходаЗаМесяц(Статья, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(&ДатаНачала, &ДатаОкончания, , СтатьяДвиженияДенежныхСредств = &Статья) КАК ДвиженияДенежныхСредствОбороты";
	Запрос.УстановитьПараметр("Статья", Статья);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата)); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Возврат Выборка.СуммаОборот;
	
	КонецЦикла;
	
	Возврат 0;

КонецФункции
