#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	
	Движение.Период = Дата;
	
	Движение.Кошелек = Кошелек;
	Движение.Сумма = Сумма;
	
	ЭтоПриходДенег = ОпределитьНаправлениеДвижениеДенег();
	
	Если ЭтоПриходДенег Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
	КонецЕсли;		
	
	Движения.ОстаткиПоДолгам.Записывать = Истина;
	Движение = Движения.ОстаткиПоДолгам.Добавить();
	
	Движение.Период = Дата;
	
	Движение.Долг = Долг;
	Движение.Сумма = Сумма;

	Если ВидОперации = Перечисления.ВидыДолговыхОпераций.Выдача Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
	Иначе 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	
	Движения.Записать();
	
	ОбновлениеСтатусаДолга(Долг);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ОпределитьНаправлениеДвижениеДенег()
	
	Если ВидОперации = Перечисления.ВидыДолговыхОпераций.Выдача Тогда
		
		Если Долг.НаправлениеДолга = Перечисления.НаправлениеДолга.МыДолжны Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
	Иначе
		
		Если Долг.НаправлениеДолга = Перечисления.НаправлениеДолга.НамДолжны Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ОбновлениеСтатусаДолга(СсылкаНаДолг)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиПоДолгамОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	Долги.Ссылка КАК Ссылка,
	|	Долги.СуммаДолга КАК СуммаДолга,
	|	Долги.Статус КАК Статус
	|ИЗ
	|	Справочник.Долги КАК Долги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоДолгам.Остатки(, ) КАК ОстаткиПоДолгамОстатки
	|		ПО (ОстаткиПоДолгамОстатки.Долг = Долги.Ссылка)
	|ГДЕ
	|	Долги.Ссылка = &СсылкаНаДолг";
	Запрос.УстановитьПараметр("СсылкаНаДолг", СсылкаНаДолг); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйСтатус = Неопределено;
		
		Если Выборка.СуммаОстаток >= Выборка.СуммаДолга Тогда
			
			НовыйСтатус = Перечисления.СтатусыДолга.Активен;
			
		ИначеЕсли Выборка.СуммаОстаток <= 0 Тогда
			
			НовыйСтатус = Перечисления.СтатусыДолга.Погашен;   
			
		Иначе 
			
			НовыйСтатус = Перечисления.СтатусыДолга.ЧастичноПогашен; 
			
		КонецЕсли;
		
		Если НовыйСтатус <> Неопределено И Выборка.Статус <> НовыйСтатус Тогда
			
			ОбъектДолга = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектДолга.Статус = НовыйСтатус;
			ОбъектДолга.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 


#КонецОбласти



