#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	СуммаЗачисления = Сумма;
	
	Если СчетПолучатель.Валюта <> Справочники.ВалютыДенежныхСредств.БелорусскийРубль Тогда  
		
		Отбор = Новый Структура("Валюта", СчетПолучатель.Валюта);                
		
		ДанныеКурса = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Отбор);
		
		Если ДанныеКурса.Курс > 0 Тогда
			
			Кратность = ?(ДанныеКурса.Кратность = 0, 1, ДанныеКурса.Кратность);
			КурсСУчетомКратности = ДанныеКурса.Курс / Кратность;
			
			СуммаЗачисления = Окр(Сумма / КурсСУчетомКратности, 2);
			
		Иначе 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не найден курс для валюты %1 на дату %2", СчетПолучатель.Валюта, Формат(Дата, "ДФ=dd.MM.yyyy"));
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
	КонецЕсли;

	Движения.ОстаткиДенежныхСредств.Записывать = Истина; 
	
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	
	Движение.Период 	= Дата;
	Движение.Кошелек 	= СчетПолучатель;
	
	Движение.Сумма = СуммаЗачисления;

	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	
	Движение.Период 	= Дата;
	Движение.Кошелек 	= СчетОтправитель;
	
	Движение.Сумма = Сумма;
 	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КонтрольПриПроведенииДокументов.ПроверитьОстаткиДенежныхСредств(Дата, СчетОтправитель, Сумма, Отказ); 	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФинансовыеЦели") Тогда
		
		Комментарий = ДанныеЗаполнения.Описание;
		СчетПолучатель = ДанныеЗаполнения.СвязанныйСчет;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти