
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКатегориями(Команда)
	ЗаполнитьКатегориямиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПрошломуМесяцу(Команда)
	ЗаполнитьПоПрошломуМесяцуНаСервере();
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКатегориямиНаСервере() 
	
	Объект.Лимиты.Очистить();
	
	Выборка = Справочники.СтатьиДвиженияДенег.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.ТипСтатьи = Перечисления.ТипыСтатей.Расход Тогда
			
			НоваяСтрока = Объект.Лимиты.Добавить();
			
			НоваяСтрока.СтатьяРасходов = Выборка.Ссылка; 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПрошломуМесяцуНаСервере() 
	
	Объект.Лимиты.Очистить();
	
	ДатаПрошлогоМесяца = ДобавитьМесяц(НачалоМесяца(Объект.Дата), -1);
	
	ДанныеЗаПрошлыйМесяц = РегистрыСведений.БюджетыПоКатегориям.СрезПоследних(ДатаПрошлогоМесяца);
	
	Для Каждого ТекСтрока Из ДанныеЗаПрошлыйМесяц Цикл
		
		НоваяСтрока = Объект.Лимиты.Добавить();
		
		НоваяСтрока.СтатьяРасходов = ТекСтрока.СтатьяРасхода;
		НоваяСтрока.СуммаЛимита = ТекСтрока.СуммаЛимита;
		
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

