#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиДенежныхСредств.Записывать = Истина;
	
	Движение = Движения.ОстаткиДенежныхСредств.Добавить();
	
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	
	Движение.Период 	= Дата;
	Движение.Кошелек 	= Кошелек;
	
	Движение.Сумма = Сумма;    
	
	Движения.ДвиженияДенежныхСредств.Записывать = Истина;
	
	Движение = Движения.ДвиженияДенежныхСредств.Добавить(); 

	Движение.Период 						= Дата;  
	Движение.СтатьяДвиженияДенежныхСредств 	= СтатьяДохода;
	
	Движение.Сумма = Сумма;

КонецПроцедуры

#КонецОбласти